In [1]:
import pandas as pd
data=pd.read_csv("book1.csv")
print(data)

       name     age    marks
0    chandu  362863    73283
1   gdfuygf   67829  3782732
2  hiufweuf  834834     4738
3  jfrhuier   58949    87845
4   jsgdufh   38974    85492
5     jbfwe   78957   895492

In [2]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   marks   6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

In [3]:
data.describe()

                 age         marks
count       6.000000  6.000000e+00
mean   240401.000000  8.215970e+05
std    315496.579343  1.488708e+06
min     38974.000000  4.738000e+03
25%     61169.000000  7.633525e+04
50%     73393.000000  8.666850e+04
75%    291886.500000  6.935802e+05
max    834834.000000  3.782732e+06

In [4]:
data.count()

name     6
age      6
marks    6
dtype: int64

In [5]:
data.min()

name     chandu
age       38974
marks      4738
dtype: object

In [6]:
data.isnull()

    name    age  marks
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False

In [7]:
data.isnull().sum()

name     0
age      0
marks    0
dtype: int64

In [8]:
data.head()

       name     age    marks
0    chandu  362863    73283
1   gdfuygf   67829  3782732
2  hiufweuf  834834     4738
3  jfrhuier   58949    87845
4   jsgdufh   38974    85492

In [9]:
data.tail()

       name     age    marks
1   gdfuygf   67829  3782732
2  hiufweuf  834834     4738
3  jfrhuier   58949    87845
4   jsgdufh   38974    85492
5     jbfwe   78957   895492

In [10]:
data.loc[3]

name     jfrhuier
age         58949
marks       87845
Name: 3, dtype: object

In [12]:
newdf=data.loc[data["age"]<1212]
print(newdf)

Empty DataFrame
Columns: [name, age, marks]
Index: []